Revit 2015 API
AnalyticalModel.IsValidProjectionType Method
 Indicates if a given Analytical Projection Type is valid for the given Analytical Element Selector and Analytical Direction.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2011
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionType() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() method or one of AnalyticalModelSurface.ProjectionZ AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties depending on arguments.")]
public bool IsValidProjectionType(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction,
	AnalyticalProjectionType projectionType
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionType() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() method or one of AnalyticalModelSurface.ProjectionZ AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties depending on arguments.")> _
Public Function IsValidProjectionType ( _
	selector As AnalyticalElementSelector, _
	direction As AnalyticalDirection, _
	projectionType As AnalyticalProjectionType _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2015. It was used as validator to AnalyticalModel.SetAnalyticalProjectionType() method that was deprecated and replaced by AnalyticalModelStick.SetProjection() method or one of AnalyticalModelSurface.ProjectionZ AnalyticalModelSurface.BottomExtension, AnalyticalModelSurface.TopExtension properties depending on arguments.")]
public:
bool IsValidProjectionType(
	AnalyticalElementSelector selector,
	AnalyticalDirection direction,
	AnalyticalProjectionType projectionType
)
Parameters
selector
Type: Autodesk.Revit.DB.Structure.AnalyticalElementSelector
 Selector of element part.
direction
Type: Autodesk.Revit.DB.Structure.AnalyticalDirection
 Direction in which Analytical Model may be projected.
projectionType
Type: Autodesk.Revit.DB.Structure.AnalyticalProjectionType
 Analytical Projection Type for Analytical Model Projection.
Return Value
 True if Projection Type is valid; false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
AnalyticalModel Class
Autodesk.Revit.DB.Structure Namespace